def initilize_cars():
    cars_catalog = []

    cars = [
        {
            "Модель": "Mustang",
            "Класс": "купе",
            "Характеристики": {
                "Цена": 30000,
                "Объем двигателя": 5.5,
                "Время разгона до 100 км": 3.5,
                "Привод": "задний",
                "Год выпуска": 2020,
                "Страна производитель": "США"
            }
        },
        {
            "Марка и модель": "BMW X5",
            "Характеристики": {
                "Цена": 60700,
                "Объем двигателя": 3.0,
                "Время разгона до 100 км/ч": 5.5,
                "Привод": "Полный",
                "Дата выпуска": 2019,
                "Страна-производитель": "Германия"
            }
        },
        {
            "Марка и модель": "Audi A4",
            "Характеристики": {
                "Цена": 40900,
                "Объем двигателя": 2.0,
                "Время разгона до 100 км/ч": 6.0,
                "Привод": "Передний",
                "Дата выпуска": 2021,
                "Страна-производитель": "Германия"
            }
        },
        {
            "Марка и модель": "lamborgini",
            "Характеристики": {
                "Цена": 1,
                "Объем двигателя": 2.0,
                "Время разгона до 100 км/ч": 0.3,
                "Привод": "Передний",
                "Дата выпуска": 4024,
                "Страна-производитель": "СССР"
            }
        },
        {
            "Марка и модель": "Nissan GT-R",
            "Характеристики": {
                "Цена": 70900,
                "Объем двигателя": 3.0,
                "Время разгона до 100 км/ч": 9.0,
                "Привод": "Передний",
                "Дата выпуска": 2012,
                "Страна-производитель": "Германия"
            }
        },
        {
            "Марка и модель": "Porsche 911 ️",
            "Характеристики": {
                "Цена": 30900,
                "Объем двигателя": 1.0,
                "Время разгона до 100 км/ч": 8.0,
                "Привод": "Передний",
                "Дата выпуска": 2002,
                "Страна-производитель": "Германия"
            }
        },
        {
            "Марка и модель": "Jaguar F-Type",
            "Характеристики": {
                "Цена": 80900,
                "Объем двигателя": 2.0,
                "Время разгона до 100 км/ч": 4.0,
                "Привод": "Передний",
                "Дата выпуска": 2021,
                "Страна-производитель": "Германия"
            }
        },
        {
            "Марка и модель": "McLaren 720S",
            "Характеристики": {
                "Цена": 90900,
                "Объем двигателя": 2.0,
                "Время разгона до 100 км/ч": 4.0,
                "Привод": "Передний",
                "Дата выпуска": 2023,
                "Страна-производитель": "Германия"
            }
        },
        {
            "Марка и модель": "jeep",
            "Характеристики": {
                "Цена": 20900,
                "Объем двигателя": 4.0,
                "Время разгона до 100 км/ч": 4.0,
                "Привод": "Передний",
                "Дата выпуска": 2019,
                "Страна-производитель": "Германия"
            }
        },

        {
            "Марка и модель": "minicuper",
            "Характеристики": {
                "Цена": 25900,
                "Объем двигателя": 2.0,
                "Время разгона до 100 км/ч": 5.0,
                "Привод": "Передний",
                "Дата выпуска": 2023,
                "Страна-производитель": "Германия"
            }
        }
    ]

    cars_catalog.extend(cars)

    for car in cars_catalog:
        car["Характеристики"]["Рассрочка"] = True

    return cars_catalog


def cars_from_kritery(kritery, param):
    cars_catalog = initilize_cars()
    found_cars = []
    for car in cars_catalog:
        if param in car["Характеристики"] and car["Характеристики"][param] == kritery:
            found_cars.append(car["Марка и модель"])

    return found_cars


def main():
    kritery = 2019
    param = "Дата выпуска"

    found_cars = cars_from_kritery(kritery, param)
    print(found_cars)


if __name__ == "__main__":
    main()